app/Controllers/Reservaciones.php

SELECT *
FROM `reservaciones`
---
    public function index(): string
    {
        $reservaciones = new ReservacionesModel();
        //FindAll = select * from nivelesacademicosModel
        $datos['datos']=$reservaciones->findAll();